Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: On Unix it's possible to first start Vim in a terminal.
es_es: En Unix es posible iniciar Vim en una terminal.

source: That's useful if you do various tasks in the same shell.
es_es: Esto es útil si se están realizando varias tareas en una misma consola.

source: If you are editing a file and decide you want to use the GUI after all, you can start it with: >
es_es: Si está editando un archivo y decide que después de todo quiere usar la GUI, puede lanzarla con la orden: >

source: Vim will open the GUI window and no longer use the terminal.
es_es: Vim abrirá la ventana de la GUI y no seguirá usando la terminal.

source: You can continue using the terminal for something else.
es_es: Puede continuar usando la terminal para lo que necesite.

source: The "-f" argument is used here to run the GUI in the foreground.
es_es: El argumento «-f» se usa aquí para ejecutar la GUI en primer plano.

source: You can also use ":gui -f".
es_es: También puede usar «:gui -f».

source: When gvim starts, it reads the gvimrc file.
es_es: Cuando gvim inicia, lee el archivo gvimrc.

source: That's similar to the vimrc file used when starting Vim.
es_es: Es similar al archivo vimrc que se usa al iniciar Vim.

source: The gvimrc file can be used for settings and commands that are only to be used when the GUI is going to be started.
es_es: El archivo gvimrc puede usarse para fijar opciones de configuración y órdenes que sólo deban usarse cuando se inicie la GUI.

source: For example, you can set the 'lines' option to set a different window size: >
es_es: Por ejemplo, puede definir la opción 'lines' para obtener un tamaño de ventana diferente: >

source: You don't want to do this in a terminal, since its size is fixed (except for an xterm that supports resizing).
es_es: No es conveniente hacer esto en una terminal, debido a que su tamaño es fijo (excepto por un xterm que soporte redimensionado).

source: The gvimrc file is searched for in the same locations as the vimrc file.
es_es: El archivo gvimrc se busca en las mismas ubicaciones que el archivo vimrc.

source: Normally its name is "~/.gvimrc" for Unix and "$VIM/_gvimrc" for MS-Windows.
es_es: Habitualmente, su nombre es «~/.gvimrc» en sistemas Unix/Linux y «$VIM/_gvimrc» en MS-Windows.

source: The $MYGVIMRC environment variable is set to it, thus you can use this command to edit the file, if you have one: >
es_es: La ruta de este archivo se almacena en la variable de entorno $MYGVIMRC, por lo que puede usar la siguiente orden para editar ese archivo, si existe: >

source: That allows starting gvim for different kinds of editing.
es_es: Esto le permite iniciar gvim para distintas formas de edición.

source: You could set another font size, for example.
es_es: Puede, por ejemplo, definir otro tamaño para el tipo de letra.

source: To completely skip reading a gvimrc file: >
es_es: Para evitar la ejecución del archivo gvimrc use: >

source: *usr_23.txt* For Vim version 7.3.
es_es: *usr_23.esx* Para Vim version 7.3.

source: This chapter is about editing files that are not ordinary files.
es_es: Este capítulo trata acerca de editar archivos que no son archivos ordinarios.

source: With Vim you can edit files that are compressed or encrypted.
es_es: Con Vim, puede editar archivos comprimidos o cifrados.

source: Some files need to be accessed over the internet.
es_es: Necesita acceder a algunos archivos a través de Internet.

source: With some restrictions, binary files can be edited as well.
es_es: Con alguna restricción, también puede editar archivos binarios.

source: Back in the early days, the old Teletype machines used two characters to start a new line.
es_es: Antiguamente, las viejas máquinas Teletype usaban dos caracteres para iniciar una nueva línea.

source: One to move the carriage back to the first position (carriage return, <CR>), another to move the paper up (line feed, <LF>).
es_es: Uno desplazaba el transporte de vuelta a la posición inicial («carriage return», <CR>), y el otro desplazaba la la página hacia arriba («line feed», <LF>).

source: When computers came out, storage was expensive.
es_es: Cuando aparecieron los ordenadores el almacenamiento era caro.

source: Some people decided that they did not need two characters for end-of-line.
es_es: Algunas personas decidieron que no necesitaban dos caracteres para marcar el final de la línea.

source: The UNIX people decided they could use <Line Feed> only for end-of-line.
es_es: La gente de UNIX decidió usar sólo <Line Feed>.

source: The Apple people standardized on <CR>.
es_es: La gente de Apple tomó <CR> como estándar.

source: The MS-DOS (and Microsoft Windows) folks decided to keep the old <CR><LF>.
es_es: La gente de MS-DOS (y Microsoft Windows) decidió seguir con el antiguo <CR><LF>.

source: This means that if you try to move a file from one system to another, you have line-break problems.
es_es: Esto supone que si intenta mover un archivo de un sistema a otro, tendrá problemas con el retorno de línea.

source: The Vim editor automatically recognizes the different file formats and handles things properly behind your back.
es_es: El editor Vim detecta los diferentes formatos de archivos automáticamente y gestiona las cosas adecuadamente sin que usted lo note.

source: The option 'fileformats' contains the various formats that will be tried when a new file is edited.
es_es: La opción 'fileformats' contiene los diversos formatos que se prueban cuando edite un archivo nuevo.

source: The following command, for example, tells Vim to try UNIX format first and MS-DOS format second: >
es_es: La siguiente orden, por ejemplo, le dice a Vim que primero pruebe con el formato UNIX, y después con el formato MS-DOS: >

source: You will notice the format in the message you get when editing a file.
es_es: Reconocerá el formato por el mensaje que obtendrá al editar un archivo.

source: You don't see anything if you edit a native file format.
es_es: No verá nada si edita un formato de archivo nativo.

source: Thus editing a Unix file on Unix won't result in a remark.
es_es: Por ello, editar un archivo UNIX en Unix no resultará en un aviso.

source: But when you edit a dos file, Vim will notify you of this:
es_es: Pero cuando edite un archivo DOS, Vim le notificará de ello:

source: For a Mac file you would see "[mac]".
es_es: Verá «[mac]» si es un archivo MAC.

source: The detected file format is stored in the 'fileformat' option.
es_es: El formato de archivo detectado se guarda en la opción 'fileformat'.

source: To see which format you have, execute the following command: >
es_es: Para ver qué formato tiene, ejecute la siguiente orden: >

source: On Unix, <LF> is used to break a line.
es_es: En Unix, se emplea <LF> para marcar un retorno de línea.

source: It's not unusual to have a <CR> character halfway a line.
es_es: No es inusual obtener un caracter <CR> en mitad de la línea.

source: Incidentally, this happens quite often in Vi (and Vim) scripts.
es_es: Fortuitamente, esto ocurre con regularidad en los scripts de Vi (y Vim).

source: On the Macintosh, where <CR> is the line break character, it's possible to have a <LF> character halfway a line.
es_es: En un Macintosh, donde <CR> marca el retorno de línea, es posible obtener un caracter <LF> en mitad de la línea.

source: The result is that it's not possible to be 100% sure whether a file containing both <CR> and <LF> characters is a Mac or a Unix file.
es_es: El resultado es que no es posible estar totalmente seguro de si es un archivo MAC o UNIX al estar presentes ambos caracteres <CR> y <LF>.

source: Therefore, Vim assumes that on Unix you probably won't edit a Mac file, and doesn't check for this type of file.
es_es: Por ello, Vim asume que probablemente no editaría un archivo MAC bajo Unix, y no revisará el tipo del archivo.

source: To check for this format anyway, add "mac" to 'fileformats': >
es_es: Para revisar el formato de todas maneras, añada «mac» a 'fileformats'.

source: Then Vim will take a guess at the file format.
es_es: Vim intentará entonces dilucidar el formato del archivo.

source: Watch out for situations where Vim guesses wrong.
es_es: Esté atento a las situaciones en las que Vim erra en su conclusión.

source: The "++" string is an item that tells Vim that an option name follows, which overrules the default for this single command.
es_es: La cadena «++» es un elemento que informa a Vim de que a continuación hay un nombre de opción que invalida el valor predeterminado, sólo de esta orden.

source: "++ff" is used for 'fileformat'.
es_es: «++ff» se usa para 'fileformat'.

source: You could also use "++ff=mac" or "++ff=dos".
es_es: También puede usar «++ff=mac» o «++ff=dos».

source: This doesn't work for any option, only "++ff" and "++enc" are currently implemented.
es_es: Esto no funciona con cualquier opción, y sólo está implementado «++ff» y «++enc».

source: The full names "++fileformat" and "++encoding" also work.
es_es: Los nombres completos, «++fileformat» y «++encoding», también funcionan.

source: You can use the 'fileformat' option to convert from one file format to another.
es_es: Puede usar la opción 'fileformat' para convertir el formato de un archivo a otro.

source: Suppose, for example, that you have an MS-DOS file named README.TXT that you want to convert to UNIX format.
es_es: Suponga, por ejemplo, que tiene un archivo MS-DOS llamado README.TXT, que desea convertir al formato UNIX.

source: Start by editing the MS-DOS format file: > vim README.TXT
es_es: Comience editando el archivo de formato MS-DOS: > vim README.TXT

source: Vim will recognize this as a dos format file.
es_es: Vim reconocerá esto como un archivo de formato MS-DOS.

source: Now change the file format to UNIX: >
es_es: Ahora cambie el formato a UNIX: >

source: Someone sends you an e-mail message, which refers to a file by its URL.
es_es: Suponga que alguien le manda un correo electrónico que le remite a un archivo a través de su URL.

source: You could start a program to download the file, save it on your local disk and then start Vim to edit it.
es_es: Puede iniciar un programa para descargar el archivo, guardarlo en su disco e iniciar Vim para editarlo.

source: There is a much simpler way.
es_es: Existe una manera mucho más simple.

source: Move the cursor to any character of the URL.
es_es: Desplace el cursor hacia cualquier carácter del URL.

source: Then use this command: >
es_es: Después ejecute esta orden: >

source: With a bit of luck, Vim will figure out which program to use for downloading the file, download it and edit the copy.
es_es: Con un poco de suerte, Vim escogerá qué programa usar para descargarse el archivo, lo descargará y editará la copia.

source: To open the file in a new window use CTRL-W f.
es_es: Para abrir el archivo en una ventana nueva use «CTRL-W f».

source: If something goes wrong you will get an error message.
es_es: Se le informará de cualquier incidencia en el proceso.

source: It's possible that the URL is wrong, you don't have permission to read it, the network connection is down, etc.
es_es: Es posible que el URL sea erróneo, que no tiene los permisos necesarios para leerlo, que la conexion a Internet se ha interrumpido, etc.

source: Unfortunately, it's hard to tell the cause of the error.
es_es: Desafortunadamente, es difícil conocer la causa del error.

source: You might want to try the manual way of downloading the file.
es_es: Puede que desee intentar una descarga manual.

source: Accessing files over the internet works with the netrw plugin.
es_es: El acceso a archivos en Internet es posible gracias a la extensión netrw.

source: Currently URLs with these formats are recognized:
es_es: A día de hoy se reconocen los siguientes formatos de URL:

source: Vim doesn't do the communication itself, it relies on the mentioned programs to be available on your computer.
es_es: Vim no realiza la conexión por si mismo, sino que depende de que los programas mencionados estén instalados en su ordenador.

source: On most Unix systems "ftp" and "rcp" will be present.
es_es: La mayoría de los sistemas Unix incluyen ftp y rcp.

source: "scp" and "wget" might need to be installed.
es_es: Puede que tenga que instalar scp y wget.

source: Vim detects these URLs for each command that starts editing a new file, also with ":edit" and ":split", for example.
es_es: Vim detecta estas URL para cada orden que inicia la edición de un archivo nuevo, también con «:edit» y «:split», por ejemplo.

source: Write commands also work, except for http://.
es_es: Las órdenes de escritura también funcionan, a excepción de «http://».

source: Carefully type the secret key now.
es_es: Escriba ahora la clave con cuidado.

source: You cannot see the characters you type, they will be replaced by stars.
es_es: No puede ver los caracteres que teclea, sino que serán reemplazados por estrellas.

source: To avoid the situation that a typing mistake will cause trouble, Vim asks you to enter the key again:
es_es: Para evitar problemas debidos a un error mecanográfico, Vim le pedirá que introduzca la clave otra vez:

source: You can now edit this file normally and put in all your secrets.
es_es: Ahora puede editar este archivo con normalidad e introducir en él todos sus secretos.

source: When you finish editing the file and tell Vim to exit, the file is encrypted and written.
es_es: Cuando haya terminado de editar el archivo este se guarda y es cifrado.

source: When you edit the file with Vim, it will ask you to enter the same key again.
es_es: Cuando edite el archivo con Vim, éste le pedirá que introduzca la contraseña otra vez.

source: You don't need to use the "-x" argument.
es_es: No necesita emplear el argumento «-x».

source: You can also use the normal ":edit" command.
es_es: Puede también usar la orden «:edit».

source: Vim adds a magic string to the file by which it recognizes that the file was encrypted.
es_es: Vim añade una cadena mágica al archivo con el cual reconoce que el archivo está cifrado.

source: If you try to view this file using another program, all you get is garbage.
es_es: Obtendrá sólo basura si intenta editar este archivo con otro programa.

source: Also, if you edit the file with Vim and enter the wrong key, you get garbage.
es_es: Así mismo, si lo abre con Vim pero introduce mal la contraseña también obtendrá basura.

source: Vim does not have a mechanism to check if the key is the right one (this makes it much harder to break the key).
es_es: Vim no posee un mecanismo para revisar si la clave es correcta (lo cual hace más difícil descifrar la clave).

source: The next time you write the file this will be done without encryption.
es_es: La siguiente vez que escriba el archivo, ésto se hará sin cifrado.

source: Setting the 'key' option to enable encryption is not a good idea, because the password appears in the clear.
es_es: Configurar la opción 'key' para activar el cifrado no es una buena idea ya que la contraseña aparece sin ocultar.

source: Anyone shoulder-surfing can read your password.
es_es: Cualquier persona leyendo por encima de su hombro puede leer su contraseña.

source: To avoid this problem, the ":X" command was created.
es_es: La orden «:X» se creó para evitar este problema.

source: It asks you for an encryption key, just like the "-x" argument did: >
es_es: Le pide una clave de cifrado, al igual que hizo el argumento «-x»: >

source: The encryption algorithm used by Vim is weak.
es_es: El algoritmo de cifrado de Vim es débil.

source: It is good enough to keep out the casual prowler, but not good enough to keep out a cryptology expert with lots of time on his hands.
es_es: Es suficiente para mantener alejado al merodeador de turno, pero no lo es para mantener alejado a un experto en cifrado con mucho tiempo libre.

source: Also you should be aware that the swap file is not encrypted; so while you are editing, people with superuser privileges can read the unencrypted text from this file.
es_es: Debe ser consciente de que el archivo de de intercambio («swap») no está cifrado; por ello, al editar, personas con privilegios de superusuario pueden leer el texto sin cifrar en este archivo.

source: One way to avoid letting people read your swap file is to avoid using one.
es_es: Una manera de evitar que le gente lea su archivo de intercambio es evitar tener uno.

source: If the -n argument is supplied on the command line, no swap file is used (instead, Vim puts everything in memory).
es_es: Si introduce el argumento «-n» en la linea de órdenes, no se usará ningún archivo de intercambio (en lugar de ello, volcará todo en la memoria).

source: For example, to edit the encrypted file "file.txt" without a swap file use the following command: >
es_es: Por ejemplo, para editar el archivo cifrado «archivo.txt» si un archivo de intercambio, use la siguiente orden: >

source: Since there is no swapfile, recovery will be impossible.
es_es: Es imposible recuperar un archivo si no existe un archivo de intercambio.

source: Save the file a bit more often to avoid the risk of losing your changes.
es_es: Guarde los datos en el archivo más regularmente para evitar perder sus cambios .

source: While the file is in memory, it is in plain text.
es_es: Un archivo está en texto simple mientras esté en memoria.

source: Anyone with privilege can look in the editor's memory and discover the contents of the file.
es_es: Cualquiera con los privilegios necesarios puede mirar en la memoria del editor y descubrir los contenidos del archivo.

source: If you use a viminfo file, be aware that the contents of text registers are written out in the clear as well.
es_es: Si está usando un archivo viminfo, sea consciente de que los contenidos del registro del texto también se escriben de manera abierta.

source: If you really want to secure the contents of a file, edit it only on a portable computer not connected to a network, use good encryption tools, and keep the computer locked up in a big safe when not in use.
es_es: Si realmente desea proteger los contenidos de un archivo, edítelo sólo en un ordenador portátil sin conexión a ninguna red, use buenas herramientas de cifrado, y guarde el ordenador en una gran caja fuerte cuando no esté en uso.

source: You can edit binary files with Vim.
es_es: Puede editar archivos binarios con Vim.

source: Vim wasn't really made for this, thus there are a few restrictions.
es_es: Vim no se creó para esta labor, y por ello hay ciertas restricciones.

source: But you can read a file, change a character and write it back, with the result that only that one character was changed and the file is identical otherwise.
es_es: Pero puede leer el archivo, cambiar un carácter y escribir esto en el archivo, con el resultado de que sólo cambió un carácter y que, en todo lo demás, el archivo es idéntico.

source: To make sure that Vim does not use its clever tricks in the wrong way, add the "-b" argument when starting Vim: >
es_es: Para impedir que Vim use sus ingeniosos trucos de manera inapropiada, añada el argumento «-b» al iniciar Vim: >

source: This sets the 'binary' option.
es_es: Esto activa la opción 'binary'.

source: The effect of this is that unexpected side effects are turned off.
es_es: El efecto que tiene es que se desactivan ciertos efectos secundarios inesperados.

source: For example, 'textwidth' is set to zero, to avoid automatic formatting of lines.
es_es: Por ejemplo, 'textwidth' recibe un valor 0, para evitar el formateo automático de las líneas.

source: And files are always read in Unix file format.
es_es: Y los archivos se leen siempre en el formato de archivo UNIX.

source: Binary mode can be used to change a message in a program.
es_es: El modo binario se puede usar para cambiar el mensaje de un programa.

source: Be careful not to insert or delete any characters, it would stop the program from working.
es_es: Tenga cuidado de no insertar o eliminar cualquier carácter, ya que impediría el funcionamiento del programa.

source: Use "R" to enter replace mode.
es_es: Use «-R» para pasar al modo «replace» (reemplazar).

source: Many characters in the file will be unprintable.
es_es: Muchos caracteres en el archivo no se pueden imprimir.

source: To see them in Hex format: >
es_es: Para verlos en formato Hex: >

source: Otherwise, the "ga" command can be used to see the value of the character under the cursor.
es_es: Por otro lado, puede usar la orden «ga» para ver el valor del carácter bajo el cursor.

source: The output, when the cursor is on an <Esc>, looks like this:
es_es: La salida, si el cursor está sobre un <Esc>, tiene este aspecto:

source: There might not be many line breaks in the file.
es_es: Puede que no haya demasiados retornos de línea en el archivo.

source: To get some overview switch the 'wrap' option off: >
es_es: Para obtener una visión de conjunto, desactive la opción 'wrap': >

source: The last two numbers are the byte position in the file and the total number of bytes.
es_es: Los dos últimos números son el byte posición en el archivo y el número total de bytes.

source: This takes into account how 'fileformat' changes the number of bytes that a line break uses.
es_es: Tiene en cuenta cómo 'fileformat' cambia el número de bytes que emplea un retorno de línea.

source: To move to a specific byte in the file, use the "go" command.
es_es: Para desplazarse a un byte específico en el archivo, use la orden «go».

source: For example, to move to byte 2345: >
es_es: Por ejemplo, para ir al byte 2345: >

source: A real binary editor shows the text in two ways: as it is and in hex format.
es_es: Un editor realmente binario muestra el texto de dos formas: tal cual y en formato hexadecimal.

source: You can do this in Vim by first converting the file with the "xxd" program.
es_es: Vim hace esto posible si primero convierte el archivo con el programa «xxd».

source: This comes with Vim.
es_es: Este programa está incluido en Vim.

source: First edit the file in binary mode: >
es_es: Primero edite el archivo en modo binario: >

source: You can now view and edit the text as you like.
es_es: Ahora puede ver y editar el texto como desee.

source: Vim treats the information as ordinary text.
es_es: Vim trata la información como texto normal.

source: Changing the hex does not cause the printable character to be changed, or the other way around.
es_es: Cambiar el valor hexadecimal no provoca un cambio en el carácter imprimible, o vicecersa.

source: Finally convert it back with: > :%!xxd -r
es_es: Por último, conviertalo otra vez con: > :%!xxd -r

source: Only changes in the hex part are used.
es_es: Sólo se usan los cambios en la parte hexadecimal.

source: Changes in the printable text part on the right are ignored.
es_es: Los cambios en la parte imprimible de texto se ignoran.

source: Vim uses the mentioned programs to do the actual compression and decompression.
es_es: Vim realiza la compresión y descompresión mediante los programas mencionados.

source: You might need to install the programs first.
es_es: Puede que primero tenga instalar los programas.

source: *usr_24.txt* For Vim version 7.3.
es_es: *usr_24.esx* Para Vim versión 7.3.

source: Last change: 2006 Jul 23
es_es: Último cambio: 23/6/2006

source: When entering text, Vim offers various ways to reduce the number of keystrokes and avoid typing mistakes.
es_es: Al introducir texto, Vim ofrece varias maneras de reducir el número de teclas que pulsa, evitando teclear errores.

source: Use Insert mode completion to repeat previously typed words.
es_es: Use el modo de autocompletado del modo Insertar para repetir palabras anteriormente tecleadas.

source: Abbreviate long words to short ones.
es_es: Abrevie las palabras largas.

source: Type characters that aren't on your keyboard.
es_es: Teclee caracteres que no están en su teclado.
